src/InformationRegisters/НастройкиПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПланировщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеЧисло</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСсылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяРесурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНастроекПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подсистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыНастроекПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыНастроекПланировщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемнаяУчетнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользоватьDHTMLX</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеРабочегоВремени</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/НастройкиПланировщика/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
 
Функция ПолучитьЗначенияНастроек(знач ПользовательСсылка = Неопределено) Экспорт
	Если НЕ ТипЗнч(ПользовательСсылка) = Тип("СправочникСсылка.Пользователи") Тогда
		ПользовательСсылка = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	НастройкиПользователей = Перечисления.ВидыНастроекПланировщика.ПолучитьНастройкиПользователей();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройки"		, НастройкиПользователей);
	Запрос.УстановитьПараметр("Пользователь"	, ПользовательСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПланировщика.Настройка,
	|	НастройкиПланировщика.Подсистема,
	|	НастройкиПланировщика.Пользователь,
	|	НастройкиПланировщика.ЗначениеСтрока,
	|	НастройкиПланировщика.ЗначениеЧисло,
	|	НастройкиПланировщика.ЗначениеДата,
	|	НастройкиПланировщика.ЗначениеСсылка,
	|	НастройкиПланировщика.ЗначениеБулево,
	|	НастройкиПланировщика.ИмяРесурса
	|ИЗ
	|	РегистрСведений.НастройкиПланировщика КАК НастройкиПланировщика
	|ГДЕ
	|	НастройкиПланировщика.Настройка В (&Настройки)
	|	И НастройкиПланировщика.Пользователь = &Пользователь";
	
	Соответствие = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Настройка			= Выборка.Настройка;		
		ЗначениеНастройки	= Выборка[Выборка.ИмяРесурса];
		
		НормализоватьЗначение(Настройка, ЗначениеНастройки);
		Соответствие.Вставить(Настройка, ЗначениеНастройки);
	КонецЦикла;
	
	// Дополним соответствие всеми настройками
	Для Каждого НастройкаСсылка Из НастройкиПользователей Цикл
		Если Соответствие.Получить(НастройкаСсылка) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗначениеНастройки = Неопределено;
		
		НормализоватьЗначение(НастройкаСсылка, ЗначениеНастройки);
		Соответствие.Вставить(НастройкаСсылка, ЗначениеНастройки);
	КонецЦикла;
	
	Возврат Соответствие;
КонецФункции

Функция ПолучитьЗначениеНастройки(знач Настройка, знач ПользовательСсылка = Неопределено) Экспорт
	
	ПустойПользователь = Справочники.Пользователи.ПустаяСсылка();
	Если НЕ ТипЗнч(ПользовательСсылка) = Тип("СправочникСсылка.Пользователи") Тогда
		ПользовательСсылка = ПустойПользователь;
	КонецЕсли;
	
	ПараметрыНастройки = Перечисления.ВидыНастроекПланировщика.ПолучитьДанныеНастройки(Настройка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Настройка"		, Настройка);
	Запрос.УстановитьПараметр("Подсистема"		, ПараметрыНастройки.Подсистема);
	Запрос.УстановитьПараметр("Пользователь"	, ?(ПараметрыНастройки.Пользователь, ПользовательСсылка, ПустойПользователь));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПланировщика.Настройка,
	|	НастройкиПланировщика.Подсистема,
	|	НастройкиПланировщика.Пользователь,
	|	НастройкиПланировщика.ЗначениеСтрока,
	|	НастройкиПланировщика.ЗначениеЧисло,
	|	НастройкиПланировщика.ЗначениеДата,
	|	НастройкиПланировщика.ЗначениеСсылка,
	|	НастройкиПланировщика.ЗначениеБулево,
	|	НастройкиПланировщика.ИмяРесурса
	|ИЗ
	|	РегистрСведений.НастройкиПланировщика КАК НастройкиПланировщика
	|ГДЕ
	|	НастройкиПланировщика.Настройка = &Настройка
	|	И НастройкиПланировщика.Подсистема = &Подсистема
	|	И НастройкиПланировщика.Пользователь = &Пользователь";
	
	ЗначениеНастройки = Неопределено;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();  
		
		ЗначениеНастройки = Выборка[Выборка.ИмяРесурса];
	КонецЕсли;
	
	НормализоватьЗначение(Настройка, ЗначениеНастройки);
	
	Возврат ЗначениеНастройки;
КонецФункции

Процедура НормализоватьЗначение(Настройка, Значение) Экспорт
	
	Если Настройка = Перечисления.ВидыНастроекПланировщика.НачалоРабочегоВремени Тогда
		Если НЕ ТипЗнч(Значение) = Тип("Число") ИЛИ Значение < 0 Тогда
			Значение = 0;
		КонецЕсли;
	ИначеЕсли Настройка = Перечисления.ВидыНастроекПланировщика.ОкончаниеРабочегоВремени Тогда
		Если НЕ ТипЗнч(Значение) = Тип("Число") ИЛИ Значение > 24 Тогда
			Значение = 24;
		КонецЕсли;
	ИначеЕсли Настройка = Перечисления.ВидыНастроекПланировщика.ИспользоватьDHTMLX Тогда
		Если НЕ ТипЗнч(Значение) = Тип("Булево") Тогда
			Значение = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
